app/controllers/deliveries_controller.rb

  def index
    unless params[:deliverable_id]
      @all_deliveries = Delivery.all(:order => "planned_date")
      @search = Delivery.search(params[:search]) #need to git rid of
      @deliveries = @search.paginate(:page => params[:page], :per_page => 100) #need to git rid of
---
SELECT * FROM "deliveries" WHERE ("deliveries".deliverable_id = 1)
SELECT count(*) AS count_all FROM "deliveries" WHERE ("deliveries".deliverable_id = 1)

      @text = "All deliverables"
    else

      @deliverable = Deliverable.find(params[:deliverable_id])
---
SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)

  def show
    @deliverable = Deliverable.find(params[:deliverable_id])
---
SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)

  def new
    @deliverable = Deliverable.find(params[:deliverable_id])
    @statuses = Status.all
---
SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)
SELECT * FROM "statuses"

  def edit
    @deliverable = Deliverable.find(params[:deliverable_id])
    @delivery = Delivery.find(params[:id])
    @statuses = Status.all
---
SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)
SELECT * FROM "deliveries" WHERE ("deliveries"."id" = 1)
SELECT * FROM "statuses"

  def create
    @deliverable = Deliverable.find(params[:deliverable_id])
    @delivery = @deliverable.deliveries.build(params[:delivery]) #was :delivery_id before
    @delivery.save
---
SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)
INSERT INTO "deliveries" ("planned_date", "actual_date", "deliverable_id", "created_at", "updated_at", "status_id") VALUES('2010-01-11 00:00:00', NULL, 1, '2010-12-16 22:18:54', '2010-12-16 22:18:54', 1)

  def update
     @deliverable = Deliverable.find(params[:deliverable_id])
     @delivery = @deliverable.deliveries.find(params[:id])
     @delivery.update_attributes(params[:delivery])
---
SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)
SELECT * FROM "deliveries" WHERE ("deliveries"."id" = 1 AND ("deliveries".deliverable_id = 1))
UPDATE "deliveries" SET "updated_at" = '2011-01-25 21:55:04', "planned_date" = '2010-11-14 00:00:00' WHERE "id" = 18

def complete
  # params[:deliveries_ids].each do |delivery_id|
  #   if Delivery.find(delivery_id).actual_date?
  #     Delivery.find(delivery_id).actual_date = nil
  #   else
  #     Delivery.find(delivery_id).actual_date = DateTime.now
  #   end
  # end


  if params[:commit] == "Complete"
    Delivery.update_all(["actual_date=?", DateTime.now], :id => params[:deliveries_ids])
  elsif params[:commit] == "Incomplete"
    Delivery.update_all(["actual_date=?", nil], :id => params[:deliveries_ids])
  elsif params[:commit] == "Delete"
    Delivery.destroy_all(:id => params[:deliveries_ids])
---
UPDATE "deliveries" SET actual_date='2011-01-20 21:36:20' WHERE ("deliveries"."id" IN ('1'))
DELETE FROM "deliveries" WHERE ("deliveries"."id" IN ('20'))