app/controllers/deliverables_controller.rb

SELECT * FROM "deliverables"
---
  def index
    # flash[:notice] = "logged in"  # TODO remove this after fixing cucumber
    # @deliverables = Deliverable.all
    # @deliverables = Deliverable.paginate :page => params[:page]  # , :order => 'number'

    @search = Deliverable.search(params[:search])

SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)
---
  def show
    @deliverable = Deliverable.find(params[:id])

SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)
---
  def edit
    @deliverable = Deliverable.find(params[:id])

INSERT INTO "deliverables" ("number", "created_at", "title", "updated_at", "discipline") VALUES('123', '2010-11-10 20:22:16', 'deliverable1', '2010-11-10 20:22:16', 'discipline 1')
---
  def create
    @deliverable = Deliverable.new(params[:deliverable])

    respond_to do |format|
      if @deliverable.save

SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 1)
UPDATE "deliverables" SET "updated_at" = '2011-01-24 20:09:03', "discipline" = '' WHERE "id" = 1
---
  def update
    @deliverable = Deliverable.find(params[:id])

    respond_to do |format|
      if @deliverable.update_attributes(params[:deliverable])

SELECT * FROM "deliverables" WHERE ("deliverables"."id" = 3)
DELETE FROM "deliverables" WHERE "id" = 3
---
  def destroy
    @deliverable = Deliverable.find(params[:id])
    @deliverable.destroy

SELECT * FROM "tags" WHERE (name LIKE 'drainage')
SELECT * FROM "tags" WHERE ("tags"."id" = 1)
SELECT "deliverables".* FROM "deliverables" JOIN taggings deliverables_taggings_structures_665 ON deliverables_taggings_structures_665.taggable_id = deliverables.id AND deliverables_taggings_structures_665.taggable_type = 'Deliverable' AND deliverables_taggings_structures_665.tag_id = 2
---
  def list_for_tag
    @tags = Tag.all
    @tag = Tag.find(params[:id])
    @deliverables = Deliverable.tagged_with(@tag)

    @deliveries = []
    # @deliverables = Deliverable.tagged_with(@tag)
    @deliverables.each do |deliverable|