app/controllers/statuses_controller.rb

SELECT * FROM "statuses"
---
  def index
    @statuses = Status.all