app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-11-14 17:10:06', '31936fd9bda85dadd66c8a6a6c0ef86bc641ddd186a50d60a527282f6a0807d09a798fe9b0fa77e4fe2355458a94b0de35de71e3f6f394223394c5bcc9cea19a', '2010-11-14 17:10:06', 'iziz', 'Dg3X5wZTeYZxgX458QIZ', '9bb4ef5eb4b3b51a6082300b2e9ae82e26fc97ae9ec54ed8e7da2ca1d69c38cd74772937e792ac5c9c03e9f4e14fd29a2afc3222c443e708ddcd295531067fad', 'iz@iz.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save